
//КОНСТАНТЫ ДЛЯ КУРСА ЗАПУСК РЕЧИ!!! ТУТ БУДЕТ ДВА ВАРИАНТА DEV-PROD!
// // //ДЛЯ ДЕБАГА
// const courseId = '21';
// const duration = '2';


//MODE 
// ДЛЯ ПОДАКТА!
const prodMode = true;

//============START SPEEECH ========== CЕКЦИЯ ДЛЯ ЗАПУСКА РЕЧИ!!!
const courseNameSpeech = 'Запуск речи';
const courseIdSpeech = prodMode ?  '8' : '8';
const durationSpeech = prodMode ? '10' : '2';


const startMessageSpeech = `
Поздравляем вас! 
Теперь Вы подписаны на курс по запуску речи детей билингвов. Данный курс включает в себя игры, задания, упражнения, рекомендации для родителей, которые направлены на формирование речи малыша, если речи до сих пор нет.

 В этом курсе собраны все самые эффективные техники, чтобы подготовить высшие психические и моторные функции малыша к процессу говорения. Поэтому речь малыша может запустится не обязательно на русском, а на любом другом языке которую ребенок слышит регулярнее в своей повседневной жизни.  

 Сегодня Вы получили первый урок, после того как Вы выполните задания и нажмете на кнопки "выполнено", либо "не выполнено" , Вам придет следующий набор упражнений. Программа устроена таким образом, что новый комплекс заданий Вам будет отправлятся один раз в сутки. Курс адаптирован под ваш темп и уровень развития ребенка. 
Желаем удачи и продуктивных занятий!`;

const rememberMessage =  `Здравствуйте! Мы обратили внимание, что Вы не отправляли ответы по заданиям курса уже несколько дней. Все ли у Вас получается выполнять? Есть ли какие то вопросы? 
Если у Вас есть вопросы, пожалуйста, напишите их в чат поддержки Вашему куратору в эту группу. https://t.me/+IMQDXlPlyssxNzcy`;

//Speeach Without Curator
const courseNameSpeechWithoutCurator = 'Запуск речи(без коуча)';

const courseIdSpeechWithoutCurator = prodMode ?  '15' : '15';

const durationSpeechWithoutCurator = prodMode ? '10' : '10';

const startMessageSpeechWithoutCurator = `
Поздравляем вас! 
Теперь Вы подписаны на курс по запуску речи детей билингвов. Данный курс включает в себя игры, задания, упражнения, рекомендации для родителей, которые направлены на формирование речи малыша, если речи до сих пор нет.

 В этом курсе собраны все самые эффективные техники, чтобы подготовить высшие психические и моторные функции малыша к процессу говорения. Поэтому речь малыша может запустится не обязательно на русском, а на любом другом языке которую ребенок слышит регулярнее в своей повседневной жизни.  

 Сегодня Вы получили первый урок, после того как Вы выполните задания и нажмете на кнопки "выполнено", либо "не выполнено" , Вам придет следующий набор упражнений. Программа устроена таким образом, что новый комплекс заданий Вам будет отправлятся один раз в сутки. Курс адаптирован под ваш темп и уровень развития ребенка. 
Желаем удачи и продуктивных занятий!`;

const rememberMessageWithoutCurator =  `Здравствуйте! Мы обратили внимание, что Вы не отправляли ответы по заданиям курса уже несколько дней. Все ли у Вас получается выполнять? Есть ли какие то вопросы?`;






// ============END SPEECH ===========

// ============== PHRASAL SPEECH ===================
const courseNamePhrasalSpeech = 'Курс по формированию фразовой речи детей билингвов';
const courseIdPhrasalSpeech = prodMode ?  '10' : '22';
const durationPhrasalSpeech = prodMode ? '10' : '2';

const startMessagePhrasalSpeech = `
Поздравляем вас! 
Теперь Вы подписаны на авторский курс по формированию фразовой речи детей билингвов. Данный курс включает в себя игры, задания, упражнения, рекомендации для родителей, которые направлены на формирование фразовойй речи малыша.

 В этом курсе собраны все самые эффективные техники, которые сформируют высшие психические и моторные функции вашего ребенка. Благодаря, этому курсу речь ребенка может формироваться не обязательно только на русском, но и на любом другом языке, которую ребенок слышит чаще в своей повседневной жизни.  

 Сегодня Вы получите первый урок, после того как Вы выполните задания и нажмете на кнопки "выполнено", либо "не выполнено». Следующийй урок Вы получите после первой встречи с Вашим куратором логопедом. На встрече с куратором вы согласуете последующее расписание отправки заданий для вас! Курс адаптирован под ваш темп и уровень развития ребенка. 
Желаем удачи и продуктивных занятий `;


//phrasal speech without curator

const courseNamePhrasalSpeechWithoutCurator = 'Курс по формированию фразовой речи детей билингвов(без коуча)';
const courseIdPhrasalSpeechWithoutCurator = prodMode ?  '17' : '17';
const durationPhrasalSpeechWithoutCurator = prodMode ? '10' : '10';
const startMessagePhrasalSpeechWithoutCurator = `
Поздравляем вас! 
Теперь Вы подписаны на авторский курс по формированию фразовой речи детей билингвов. Данный курс включает в себя игры, задания, упражнения, рекомендации для родителей, которые направлены на формирование фразовойй речи малыша.

 В этом курсе собраны все самые эффективные техники, которые сформируют высшие психические и моторные функции вашего ребенка. Благодаря, этому курсу речь ребенка может формироваться не обязательно только на русском, но и на любом другом языке, которую ребенок слышит чаще в своей повседневной жизни.  

 Сегодня Вы получите первый урок, после того как Вы выполните задания и нажмете на кнопки "выполнено", либо "не выполнено». Следующийй урок Вы получите после первой встречи с Вашим куратором логопедом. На встрече с куратором вы согласуете последующее расписание отправки заданий для вас! Курс адаптирован под ваш темп и уровень развития ребенка. 
Желаем удачи и продуктивных занятий `;



//--------- FINISH PHRASAL SPEECH -----------------



const courseMarathonR = 'Марафон Р';

const courseIdMarathonR = prodMode ?  '3' : '3';

const durationMarathonR = prodMode ? '10' : '2';

const startMessageMarathonR = `Поздравляем вас! Теперь Вы подписаны на курс Марафон Р, в скором времени Вам придет первый урок!`;

const coachMarathonR = '4';


//DEFAULT коуч для запуска речи // !!! DEBUG
// const coachId = '4';

//!! PROD
const coachId = prodMode ? '45' : '44'; // ОЛЬГА ДАНТЮК (45) - 44 тестовый мой коуч

//запуск мови (запуск речи - укаінский варіант)
const courseNameSpeechUA = 'Запуск мови';
const courseIdSpeechUA = prodMode ?  '13' : '13';
const durationSpeechUA = prodMode ? '10' : '10';
const startMessageSpeechUA = `Вітаємо вас! Тепер ви підписані на курс з розвитку мовлення дітей-двомовок. Цей курс включає ігри, завдання, вправи, рекомендації для батьків, спрямовані на формування мовлення малюка, якщо до цього часу він ще не почав говорити.
У цьому курсі зібрані всі найефективніші техніки, щоб підготувати вищі психічні та рухові функції малюка до процесу спілкування. Тому мовлення малюка може розпочатися не обов'язково російською, а будь-якою іншою мовою, яку дитина чує регулярно у своєму повсякденному житті.
Сьогодні ви отримали перший урок. Після виконання завдань та натискання кнопок "виконано" або "не виконано", вам буде надіслано наступний набір вправ. Програма адаптована до вашого темпу та рівня розвитку дитини. Бажаємо успіхів та продуктивних занять!`;

//запуск мовлення (без коуча)
const courseNameSpeechUAWithoutCoach = 'Запуск мови(без коуча)';
const courseIdSpeechUAWithoutCoach = prodMode ?  '16' : '16';
const durationSpeechUAWithoutCoach = prodMode ? '10' : '10';
const startMessageSpeechUAWithoutCoach =`Вітаємо вас! Тепер ви підписані на курс з розвитку мовлення дітей-двомовок. Цей курс включає ігри, завдання, вправи, рекомендації для батьків, спрямовані на формування мовлення малюка, якщо до цього часу він ще не почав говорити.
У цьому курсі зібрані всі найефективніші техніки, щоб підготувати вищі психічні та рухові функції малюка до процесу спілкування. Тому мовлення малюка може розпочатися не обов'язково російською, а будь-якою іншою мовою, яку дитина чує регулярно у своєму повсякденному житті.
Сьогодні ви отримали перший урок. Після виконання завдань та натискання кнопок "виконано" або "не виконано", вам буде надіслано наступний набір вправ. Програма адаптована до вашого темпу та рівня розвитку дитини. Бажаємо успіхів та продуктивних занять!`;


//фразове мовлення (фразовая речь - укаінский варіант)
const courseNamePhrasalSpeechUA = 'Формування мови';
const courseIdPhrasalSpeechUA = prodMode ?  '14' : '14';
const durationPhrasalSpeechUA = prodMode ? '10' : '10';
const startMessagePhrasalSpeechUA = `Вітаємо!
Тепер Ви підписані на авторський курс Тетяни Дьоміної "Формування фразової мови дітей білінгвів". Даний курс включає ігри, завдання, вправи, рекомендації для батьків, які спрямовані на формування фразової мови малюка.

У цьому курсі зібрані всі найефективніші техніки, які сформують вищі психічні та моторні функції вашої дитини. Завдяки цьому курсу мова дитини може формуватися не обов'язково тільки українська, але і будь-яка інша мова, яку дитина чує частіше у своєму повсякденному житті.

Ви отримали перший урок. Після виконання завдання, потрібно натиснути кнопку "виконано", або "не виконано" і вам прийде наступний урок з вправами.

Програма налаштована таким чином, що нові завдання вам будуть надсилатися відповідно до розкладу, який ви погодете з вашим куратором.
Якщо Ви маєте запитання, будь ласка, напишіть їх у чат вашому куратору.`;

//фразове мовлення (без коуча)
const courseNamePhrasalSpeechUAWithoutCoach = 'Формування мови(без коуча)';
const courseIdPhrasalSpeechUAWithoutCoach = prodMode ?  '18' : '18';
const durationPhrasalSpeechUAWithoutCoach = prodMode ? '10' : '10';
const startMessagePhrasalSpeechUAWithoutCoach = `Вітаємо!
Тепер Ви підписані на авторський курс Тетяни Дьоміної "Формування фразової мови дітей білінгвів". Даний курс включає ігри, завдання, вправи, рекомендації для батьків, які спрямовані на формування фразової мови малюка.

У цьому курсі зібрані всі найефективніші техніки, які сформують вищі психічні та моторні функції вашої дитини. Завдяки цьому курсу мова дитини може формуватися не обов'язково тільки українська, але і будь-яка інша мова, яку дитина чує частіше у своєму повсякденному житті.

Ви отримали перший урок. Після виконання завдання, потрібно натиснути кнопку "виконано", або "не виконано" і вам прийде наступний урок з вправами.

Програма налаштована таким чином, що нові завдання вам будуть надсилатися відповідно до розкладу, який ви погодете з вашим куратором.
Якщо Ви маєте запитання, будь ласка, напишіть їх у чат вашому куратору.`;






module.exports = {
    //Speech
    courseNameSpeech,
    courseIdSpeech,
    durationSpeech,
    startMessageSpeech,
    coachId,
    //SpeechWithoutCurator
    courseNameSpeechWithoutCurator,
    courseIdSpeechWithoutCurator,
    durationSpeechWithoutCurator,
    startMessageSpeechWithoutCurator,
    //PhrasalSpeech
    courseNamePhrasalSpeech,
    courseIdPhrasalSpeech,
    durationPhrasalSpeech,
    startMessagePhrasalSpeech,
    //PhrasalSpeechWithoutCurator
    courseNamePhrasalSpeechWithoutCurator,
    courseIdPhrasalSpeechWithoutCurator,
    durationPhrasalSpeechWithoutCurator,
    startMessagePhrasalSpeechWithoutCurator,

    //MarathonR
    courseMarathonR,
    courseIdMarathonR,
    durationMarathonR,
    startMessageMarathonR,
    coachMarathonR,
    //SpeechUA
    courseNameSpeechUA,
    courseIdSpeechUA,
    durationSpeechUA,
    startMessageSpeechUA,
    //SpeechUAWithoutCoach
    courseNameSpeechUAWithoutCoach,
    courseIdSpeechUAWithoutCoach,
    durationSpeechUAWithoutCoach,
    startMessageSpeechUAWithoutCoach, 
    //PhrasalSpeechUA
    courseNamePhrasalSpeechUA,
    courseIdPhrasalSpeechUA,
    durationPhrasalSpeechUA,
    startMessagePhrasalSpeechUA,
 
    //PhrasalSpeechUAWithoutCoach
    courseNamePhrasalSpeechUAWithoutCoach,
    courseIdPhrasalSpeechUAWithoutCoach,
    durationPhrasalSpeechUAWithoutCoach,
    startMessagePhrasalSpeechUAWithoutCoach,

}


